[
  {
    "Name": "陳柏達",
    "Content": "在這次的服務中，我們循序漸進教導小朋友安裝需要的軟體，並在他們不懂或出錯的時候伸出援手。我的方式是先看小朋友操作一遍，在錯誤的部分給予指導，讓他們思考怎麼做才是正確的。這次的營隊經驗，讓我理解並不是所有小朋友的家裡都有電腦使用，有些小朋友在操作電腦上可能比其他人更不熟悉一點，我自認應該要多參加艾妲培訓營，給這些小朋友更多學習的機會 。在這次的營隊剛開始時，我們組員之間雖然不太熟悉，但是大家很有默契的相互配合。配合講師的講解，有空的人就去台下幫助小朋友，其他人就負責拍攝照片作活動紀錄，大家各司其職，穩定整體教室的秩序。"
  },

  {
    "Name": "高小喬",
    "Content": "今天我教了「認識烏龜機器人」，但因為濃縮課程的關係，我也教了一些迴圈的概念與「烏龜農場I」，雖然課程難度一下子提高了不少，但還是有不少學員做出我們給予的任務，甚至超出了我們的想像，雖然可能不是最完美的解法，但能夠用最簡單的方式完成就已經很欣慰了，代表他們能夠理解題目並擁有一定的邏輯思考。雖然學員們在完成任務的過程中有些不太受控，但也都有好好地完成了，最終結束時南門國小的資訊組長才向學員們宣佈此次的營隊只到今天，當宣佈的同時聽到學員們哀聲遍野，頓時覺得很開心，代表我們成功的帶給他們有收穫又有趣的一天了，也有很多學員來跟我們說希望之後還能有類似的營隊能夠參加，學員們都覺得這次的時間實在是太短了，可以感受到他們都對於此次的營隊充滿了熱忱。"
  },

  {
    "Name": "李昱霖",
    "Content": "大潭國小是和ADA營隊合作開辦寒暑假志工營隊許多年的學校，但我是第一次前往大潭國小。不大的校地，稀少的學生與老舊的電腦教室，在操場另一側的活動區倒是有著保存良好的對學生用的運動娛樂設施。我們原先運用五天的時間將Minecraft的世界呈現在小朋友的面前，讓他們先感到興趣，再理解與實作那些我們融入游玩中的程式元素，達到學習程式邏輯的教學目的。在僅有的第一天的課程上，我們讓小朋友認識了Minecraft與對本次的一大教學工具“小烏龜”進行了認識。我缺少管控失序課堂的經驗，因爲我很少造成課堂的失序，但若今非是我的原因卻因由我來管控，那對我而言則是艱難的挑戰。我可以選擇任由小孩在課堂上我行我素只要他們完成了最低限度的目標，又或是我能因材施教找出每個小孩最合適的引導方式讓他們真正有所收穫。"
  },
  
  {
    "Name": "范太恩",
    "Content": "在這次的營隊裡從一開始的培訓課到最後上營期間，雖然上營期間因為疫情的關係只有短短一天，在這段期間裡我學到了拍照的技巧及製作簡報的技巧，由於我是我們這組的小隊長，我也學到了要如何調度組員分配工作等等，當然最重要的是與小學員們的互動，例如:課程要如何安排讓他們比較不會感到無趣…等等。"
  },
  
  {
    "Name": "張慧亭",
    "Content": "儘管營隊只維持了短短的一天，我們也盡力的把所有知識傳遞給學生們，很開心看到學生們對於學習的熱情，且非常願意把自己的問題提出，讓我們可以快速掌握他們的學習狀況。與學生在課前訂定規則，學生在課堂中都會細心遵守、配合良好，讓我們的教學過程更加順利、講解更加清晰。也很感謝大湖國小的師長用心的與我們討論各項事宜，讓我們有個良好的教學環境。在教學的過程中，看見許多學生有問題都很願意詢問，同學之間有問題也都很願意互相幫忙，想想現在的自己，不知道從什麼時候開始變得不敢問問題，怕自己問的問題很愚蠢，然而其實所有的疑問都是很值得被提起的，因為當你有問題時，也許也有人有相同的問題需要被解決，因此我認為不恥下問才是促使自己能夠更成長的方式，另外，當有人有問題時我也應該挺身而出盡力幫助，這是我從學生們的行為上看見應該自我反省的地方。"
  },
  
  {
    "Name": "楊宗泰",
    "Content": "第一次做會先切他們畫面，講解ppt內容後，再帶他們實際做一遍，接著讓他們自己做，如果他們還是有問題的話，舉手讓我們小組的成員知道並一同協助，且讓他們思考怎麼做才是對的。這次營隊出現最大的問題就是創立麥塊帳號，很多小朋友沒有google帳號，而且也沒帶到手機，因此前面幫他們創帳號時都是用我們手機號碼，但後面發現每個手機號碼能創的帳號數有限，不過所幸後面有發現一個帳號可以多人使用，才解決了這個問題。在營隊開始之前，我跟組員們之間雖然不是很熟悉，但在短短的幾分鐘後，大家都很有默契的互相配合，自行分配好工作去執行，也在短時間內跟幾位小朋友處得不錯，讓整個氛圍非常好。"
  },
  
  {
    "Name": "蔡曜亦",
    "Content": "透過螢幕的切換，和小朋友熱情地發問，讓他們藉由實作的方式，放手試著靠自己的想法去解決問題，再慢慢引導他們解決問題的思考方向。在教學的過程中發現其實每個小朋友的思考方式都不一樣，學習新事物的速度也不同，但讓他們分組互相學習解答，讓我再次體會到彼此互助互相成長的概念。在最後填寫表單和教學時，有小朋友較害羞，不敢舉手發問或借筆填寫表單，就發現他的朋友很幫忙他，總是替他舉手發問，很有愛心。"
  },
  {
    "Name": "張昊霖",
    "Content": "Minecraft按裝直接用壓縮檔比較快，之後帳號可以用同一個就可以了，小朋友耐心沒有很好，所以安裝的步驟要盡快完成，不然小孩子之後上課心態可能會有點糟。Minecraft程式可能對於小朋友來有點不友善，第一指是用英文，第二不夠直覺，我們在設計程序過程中很多時候寫出了簡短的程式碼，所以之後的課程教材第一步要能夠直覺了解程式碼，和給小任務給小朋友，要重複確認他們是否了降和列出任務清單。早做完課堂要求能玩Minecraft滿重要的。"
  },
  {
    "Name": "王士豪",
    "Content": "登入上出現很多問題，大部分小朋友都忘記學校信箱，就算我們用了免洗信箱，還是需要手機驗證，我們只好用自己的手機驗證，手機驗證還是有一個數量上限，最後發現用同一個帳號登入就好。小朋友們都很聰明，比我們規劃的進度超前，在11點左右就全部安裝完，並且開始玩了，後來我們把第二天的內容也教了一些。在休息時，發現有一個小朋友自己就會做TNT大砲，很厲害!"
  },
  {
    "Name": "江煒彬",
    "Content": "我學到比較多的是PPT的製作，主要是在版面的配置有更多小細節操作能讓我更快達成想要做的目的，以前我也沒這麼精心製作過，這次為了教小朋友，PPT的修改是一改再改，前前後後一個PPT大概花了我一個禮拜的時間，因為常常在想這裡是不是能再改得更容易讓小朋友理解，以及盡量讓圖片說明大於文字說明，畢竟小朋友應該比較喜歡看圖片。參加完艾妲其實有很多感觸，已經很久沒有接觸小朋友了，現在一接觸竟然就是要去教他們，有種成長的感覺，另一種是擴展視野的感覺，在成長的過程中，日漸體會到科技的重要性並覺得能越早學越能得到好處或在未來能更吃香，所以也很慶幸能參加艾妲投身偏鄉教育之中，能為台灣培養一批小幼苗"
  },
  {
    "Name": "吳宏為",
    "Content": "由於有些小朋友先前就有接觸過Minecraft，所以他們有時會問出一些較深入的問題，但我沒有玩過Minecraft，因此無法給他們良好的答案，對此我覺得很抱歉也很可惜，或許在行前的準備，我應該對Minecraft有更深入的了解，那希望未來我還有機會去華勛國小補足剩下的四天艾妲資訊營，屆時我一定會做好準備，一定準確的回答小朋友的各種疑問。此次教到的是五、六年級的小朋友，他們的程度相當不錯，且在我教課時，小朋友總會熱烈的回應、踴躍的舉手，希望他們未來也繼續對各種未知的事物保有熱情，很幸運的可以教到這群小朋友。另外，因為疫情關係，原本五天的營隊縮減成了一天，但我們盡力濃縮了課程，希望他們有所學，但我還是覺得相當可惜，希望未來還有機會補上剩餘的四天。"
  },
  {
    "Name": "李浤瑋",
    "Content": "由於陳康國小的學生程度都很好，他們常常問出一些超出進度的問題，有其中一位小朋友就問了:「如何做出電梯」，老實說這個早已超出我的能力範圍，因為我沒有玩過minecraft。但仔細回想，在出發前，盧聖周有曾經介紹過永動機的製作給我看，我雖然當時有看懂，但並不是非常熟悉，而小朋友問的電梯，立刻就讓我想到永動飛船的應用，當時就有種感覺，像是「考試時看到之前看過的題目，卻因為當時沒有讀熟而感到後悔」，最後我仍然沒有做出電梯給那位小朋友，真的覺得很抱歉。陳康國小的學生都很乖，我們講的話他們都有聽，程度也都非常不錯，真的很幸運能服務到這所學校，原本5天的課程，因為疫情只剩1天，我們只好濃縮我們所有的教課內容，將我們會的一切都盡可能給他們。"
  },
  {
    "Name": "周軒睿",
    "Content": "在事前知道所有自立國小的學生在資訊課有申辦gmali帳號，可供遊戲註冊，也許是同一個IP位置同時太多人一起註冊，導致遊戲帳號的申請需要手機認證，確保我們並非人頭帳戶，這些都是在家試驗時沒有發生的狀況。一開始使用免洗手機號碼，發現早已被使用至超過註冊上限，最後將我們講師以及有成功註冊的同學的帳號分給未註冊的通學使用，才結束這場騷動。午餐時有位圓圓肉肉的孩子，在午餐發下不到10分鐘便吃完一份雞腿邊當，不斷的喊著，好餓還想再吃，旁邊的同學便紛紛將便當中的飯菜分給這位同學，感到十分暖心。"
  },
  {
    "Name": "林祐安",
    "Content": "主要指導的課程只有「烏龜煙火秀」，稍微把難度拉高來測試小朋友的程度，沒想到還是有5位小朋友把程式打出來，雖然不是每個人都能以最簡短的方式寫出，但至少有理解題目並以自己的邏輯思考，我覺得這是他們這個階段非常的重要的環節。因為疫情的關係，在大學一年多的時間內取消了一次次的活動，對於服務的熱忱也逐漸地被磨光，開始失去努力的目標，雖然這次也是因為疫情的關係取消了艾妲的活動，其實剛好有另一個活動和艾妲上營的時間撞期，選擇了艾妲的我並不後悔，我在這次活動找尋到自己對於服務的熱忱，有時候付出並不見得會得到很好的結果，但服務這件事本身就是不求回報的，只希望能跟真正幫助到需要的人並且得到他們肯定的微笑。"
  },
  {
    "Name": "張祐勻",
    "Content": "雖然這是我第一次參加有資訊的營隊，且我的本科系也不是學這方面的專業，所以起初進來的時候是有點壓力的。我覺得這次的營隊最主要的收獲是在準備的過程，因為我們的教材不是到特別艱深要把它轉換為往後可以運用的能力有一定的難度。準備的過程中，組員們互相討論，選擇出最好的教案內容，還有實際上營後，我們遇到問題一起同心協力地解決，我覺得這是很難能可貴的！課堂中有一個小男孩讓我非常印象深刻，一開始上課的時候我就有發現他抱著一本書在看，結果近看發現他看的竟然是撰寫麥塊方塊程式的書！超級佩服，真的是抱持一個想學程式的心的認真小朋友！"
  },
  {
    "Name": "梁羽承",
    "Content": "現在小朋友的學習能力超強，其中有一個小朋友靠自己的想法加上我們一點點的協助，就完成了讓烏龜蓋房子的程式，而且還蓋出跟我們教學不同種類的房子。因為疫情的關係，營隊只有一天的時間，我們為了讓小朋友可以學到一些東西，將一些後面的課程前到這天做講解，小朋友的反應都不錯、玩得很開心，而且很多小朋友都能自己完成我們給他們的挑戰題，希望疫情趨緩後能把剩下的課程教完。"
  },
  {
    "Name": "梁瑞恩",
    "Content": "有些小朋友已經玩過minecraft了，我們在剛開始介紹基本操作的時候，他們會覺得的無聊，而且想要我們幫他們做一些進階的操作，但是要顧及第一次玩得學生們，所以變得有點拖沓。而且後來發現大家只要共用一個windows帳號就好，不用花那麼多時間。現在小朋友有些已經有很充足的電腦能力，能自己安裝,minecraft程式，有些則因為沒甚麼使用過電腦需要他人的協助，對於那些超前進度的學生應該要安排一些活動讓他們專注在課程中。"
  },
  {
    "Name": "陳奕儒",
    "Content": "教學小朋友用程式來玩麥塊，不過有80%都有玩過麥塊的遊戲，所以在教學上有些東西對他們來說太簡單了。這次是我第一次帶小朋友們，以往我自己不是很敢在很多人的地方說話，但是在艾妲的這段期間逐漸地訓練著這些，漸漸地也改變了我自己。"
  },
  {
    "Name": "鄭家晏",
    "Content": "我從這次服務中學習到最多的是教學備案的重要性吧，因為疫情營期被縮減了很多，為了給學生豐富的課程，我們趁中午休息時間將課表做大調整，許多補充專案也盡全力的帶給大家，這個萬萬沒想到的情況給我們上了重要的一課。參加這次營隊的小朋友真的比想像中的乖也都很聽話，上課認真聽講確實練習，下課時間很活潑也願意跟我們聊天一起玩，有一位學員對程式特別感興趣，很積極的學習關於烏龜的使用方式。我和組員原本就認識，但經過這次合作更了解彼此的做事風格，期待以後的共事。"
  },
  {
    "Name": "鄭鈺均",
    "Content": "過程中瞭解到，有些學員可能連基本的電腦操作都不太熟悉，以至於對可堂內容的理解也有限。我們一開始採小組制，希望已經會的同學可以先去教不會的人，若有解決不了的問題，在舉手請我們過去幫忙。在製作教案的部分其實也反覆修改了好幾次，其實最困難的部分就是要站在初學的立場，去製作出能讓大家都理解且淺顯易懂的內容。每個人對於來營隊的理解和目的都不一樣，因此我們發下去的指令也不一定每個學員都能跟得上，有些人很完整的做出，有些人是因為無法理解卡住，有人做完了會幫助別人或是超前進度挑戰下一向任務，我覺得這些都是很有趣的現象"
  },
  {
    "Name": "盧聖周",
    "Content": "主要是想透過烏龜模組培養邏輯以及除錯的概念，當日最終的目標是讓他們用烏龜機器人依靠程式蓋出房子，有展示過我們房子的蓋法以及程式的部分，讓他們去做各種改變跟操作，因為轉換成程式對小朋友來說相對複雜，對於烏龜的操作特性也沒完全摸熟，多少還是要給些引導。不過最後很多人有完成蓋房子的課題，也發揮了不少他們的創意，甚至有些用了跟我們完全不一樣的方法去蓋房子，可以看出他們有在做嘗試以及思考各種可能性，並解決中途發生的問題，相當不錯。早上剛上沒多久時就接獲因為疫情後面幾天的活動將會取消，不過還沒有告訴那些小學員，有幾個人就纏著我一直問我明天會不會來，覺得還是挺開心地至少他們應該還挺喜歡我們的，一早到教室時也有好幾個很有活力的跟我打招呼，覺得他們還是挺可愛的"
  },
  {
    "Name": "賴君宇",
    "Content": "現在小朋友的學習能力超強，其中有一個小朋友靠自己的想法加上我們一點點的協助，就完成了讓烏龜蓋房子的程式，而且還蓋出跟我們教學不同種類的房子。因為疫情的關係，營隊只有一天的時間，我們為了讓小朋友可以學到一些東西，將一些後面的課程前到這天做講解，小朋友的反應都不錯、玩得很開心，而且很多小朋友都能自己完成我們給他們的挑戰題，希望疫情趨緩後能把剩下的課程教完。"
  },
  {
    "Name": "戴豪廷",
    "Content": "授課與上課，兩個看似不同面向的東西，但回歸原點終究是學習的一環，扮演授課老師的我們，除了使用所學的資訊技巧外，更需要學習的就是如何將這些技巧、知識分享給不同年齡層、任何想學習相關知識的人，以前的我大概會以為教書跟上課很容易，念念課本、管理秩序等等，直到自己接觸後，才發現並不是我想的那樣，授課雖然是分享經驗、知識，但最重要的是如何讓其他人能理解，因此授課的方法就很重要，比起死板板的教學模式，我更喜歡用引導、摸索的方式來分享知識與經驗，畢竟這些東西只有自己懂了才有用，在參與幾次營隊後，我認為這些經驗讓我學習到了不少，不論是授課的方法、團隊的合作與溝通等等，最重要的是其他小朋友能夠從自己的身上學到東西。"
  }

]